<div style="font-size:18pt; padding-top:20px; text-align:center">СЕМИНАР. <b>Введение в </b> <span style="font-weight:bold; color:green">Pandas</span></div><hr>
<div style="text-align:right;">Папулин С.Ю. <span style="font-style: italic;font-weight: bold;">(papulin.study@yandex.ru)</span></div>

<a name="0"></a>
<div><span style="font-size:14pt; font-weight:bold">Содержание</span>
    <ol>
        <li><a href="#1">Основные типы данных в Pandas</a></li>
            <ol style = "list-style-type:lower-alpha">
                <li><a href="#1a">Последовательность</a></li>
                <li><a href="#1b">Табличная структура данных (DataFrame)</a></li>
                <li><a href="#1c">Панель (Panel)</a></li>
            </ol>
        <li><a href="#2">Первые шаги с DataFrame</a></li>
            <ol style = "list-style-type:lower-alpha">
                <li><a href="#2a">Создание DataFrame</a></li>
                <li><a href="#2b">Обращение к элементам</a></li>
                <li><a href="#2c">Запись содержания DataFrame во внешний файл</a></li>
                <li><a href="#2d">Загрузка внешних данных в DataFrame</a></li>
            </ol>
        <li><a href="#3">Манипулирование DataFrame'ми</a></li>
            <ol style = "list-style-type:lower-alpha">
                <li><a href="#3a">Столбцы</a></li>
                <li><a href="#3b">Строки</a></li>
                <li><a href="#3c">Значения ячеек</a></li>
                <li><a href="#3d">Группировка</a></li>
                <li><a href="#3e">Сортировка</a></li>
                <li><a href="#3f">Сложные индексы</a></li>
                <li><a href="#3g">Объединение DataFrame'ов: <i>append, concat, merge, join</i></a></li>
                <li><a href="#3h">Методы <i>iterrows</i>, <i>map</i>, <i>apply</i>, <i>applymap</i></a></li>
            </ol>
        <li><a href="#4">Математическая поддержка</a></li>
            <ol style = "list-style-type:lower-alpha">
                <li><a href="#4a">Операции со столбцами</a></li>
                <li><a href="#4b">Специальные методы</a></li>
            </ol>
        <li><a href="#5">Визуализация данных</a></li>
            <ol style = "list-style-type:lower-alpha">
                <li><a href="#5a">График (plot)</a></li>
                <li><a href="#5b">Гистограмма</a></li>
            </ol>
        <li><a href="#6">Источники</a></li>
    </ol>
</div>

Подключение стилей оформления

In [ ]:
%%html
<link href="css/style.css" rel="stylesheet" type="text/css">

<a name="1"></a>
<div style="display:table; width:100%; padding-top:10px; padding-bottom:10px; border-bottom:1px solid lightgrey">
    <div style="display:table-row">
        <div style="display:table-cell; width:80%; font-size:14pt; font-weight:bold">1. Основные типы данных в <span style="font-weight:bold; color:green">Pandas</span></div>
    	<div style="display:table-cell; width:20%; text-align:center; background-color:whitesmoke; border:1px solid lightgrey"><a href="#0">К содержанию</a></div>
    </div>
</div>

<div>
<p><b>Рассматриваемые вопросы:</b></p>
<p style="line-height:20pt">
a) последовательность <span style="font-weight:bold; color:green">Series</span><br> 
b) табличная структура <span style="font-weight:bold; color:green">DataFrame</span><br> 
c) панель <span style="font-weight:bold; color:green">Panel</span><br>
</div>

In [1]:
import pandas as pnd
import numpy as np

<a name="1a"></a>
<div style="padding-top:10px;">
    <div style="display: inline-block; font-style:italic; font-weight:bold; font-size:12pt">a. Последовательность (<span style="font-weight:bold; color:green">Series</span>)</div>
    <div style="display: inline-block; float:right; width:20%; text-align:center; border:1px solid lightgrey">
        <div style="display: inline-block; text-align:center; width:50%; background-color:whitesmoke;"><a href="#1">Назад</a></div><div style="display: inline-block; text-align:center; width:50%;"><a href="#1b">Далее</a></div>
    </div>
</div>

<p>Последовательность <span style="font-weight:bold; color:green">Series</span> - одномерный массив с метками (индексами) для хранения различных типов данных: целых (integer), действительных чисел (float), строк (string), объектов Python</p>

In [ ]:
s = pnd.Series(data=["Dima", "Sveta","Alex", "Ivan", "Kate", "Maria"], index=list(range(1,7)), name="Name")
s

In [ ]:
l_num = [-2.011894, 0.098981, 0.693385, 1.055508, 0.640023]
l_num

In [ ]:
s2 = pnd.Series(data=l_num, index=['a', 'b', 'c', 'd', 'e'], name="Number")
s2

In [ ]:
l_num = [-2.0, 0.0, 0.0, 1.0, 0.0]
l_num

In [ ]:
s3 = pnd.Series(data=l_num, index=['a', 'b', 'c', 'd', 'e'], name="Number", dtype='int32')
s3

<p>Вывод первых (<i>head</i>) и последних (<i>tail</i>) $n$ значений</p>

In [ ]:
s.head(2)

In [ ]:
s.tail(2)

<p>Обращение к элементам <span style="font-weight:bold; color:green">Series</span></p>

In [ ]:
s[3]

In [ ]:
s2['b']

In [ ]:
s[3] = "NewAlex"
s

<a name="1b"></a>
<div style="padding-top:10px;">
    <div style="display: inline-block; font-style:italic; font-weight:bold; font-size:12pt">b. Табличная структура данных (<span style="font-weight:bold; color:green">DataFrame</span>)</div>
    <div style="display: inline-block; float:right; width:20%; text-align:center; border:1px solid lightgrey">
        <div style="display: inline-block; text-align:center; width:50%; background-color:whitesmoke;"><a href="#1a">Назад</a></div><div style="display: inline-block; text-align:center; width:50%;"><a href="#1c">Далее</a></div>
    </div>
</div>

<p>Табличная структура <span style="font-weight:bold; color:green">DataFrame</span> - двумерный массив с метками</p>

In [ ]:
rand_matrix = np.random.randn(4,3)
rand_matrix

In [ ]:
cmls = ["Column_1", "Column_2", "Column_3"]
cmls

In [ ]:
df = pnd.DataFrame(data=rand_matrix, columns=cmls)
df

In [ ]:
df2 = pnd.DataFrame(data=rand_matrix, columns=cmls, index=['a','b','c','d'])
df2

<p>Вывод первых и последних $n$ значений</p>

In [ ]:
df2.head(2)

In [ ]:
df2.tail(2)

<p>Способы обращения к столбцам, строкам и ячейкам <span style="font-weight:bold; color:green">DataFrame</span>'а рассматриваются в следующих разделах</p>

<a name="1c"></a>
<div style="padding-top:10px;">
    <div style="display: inline-block; font-style:italic; font-weight:bold; font-size:12pt">с. Панель (<span style="font-weight:bold; color:green">Panel</span>)</div>
    <div style="display: inline-block; float:right; width:20%; text-align:center; border:1px solid lightgrey">
        <div style="display: inline-block; text-align:center; width:50%; background-color:whitesmoke;"><a href="#1b">Назад</a></div><div style="display: inline-block; text-align:center; width:50%;"><a href="#2">Далее</a></div>
    </div>
</div>

<div class="msg-block msg-imp">
    <div class="msg-text-imp">
        Panel были удалены в pandas 0.25.0
    </div>
</div>

<p>Панель <span style="font-weight:bold; color:green">Panel</span> - контейнер для трехмерных данных</p>

<p>Создание панели с использованием списков</p>

In [ ]:
data_3d = [[["TV", 100, 40],
            ["Smartphone", 50, 10], 
            ["Pendrive", 10, 10]],
           [["TV", 90, 48],
            ["Smartphone", 45, 12], 
            ["Pendrive", 12, 8]]]
data_3d

In [ ]:
p = pnd.Panel(data=data_3d, 
              items=["Jan","Feb"], 
              major_axis=list(range(3)), 
              minor_axis=["Item_Name","Item_Price","Item_Total"])
p

<p>Создание панели через словарь</p>

In [ ]:
data_3d = {"Jan": {"Item_Name":["TV", "Smartphone", "Pendrive"],
                    "Item_Price":[100, 50, 10], 
                    "Item_Total": [40, 10, 10]}, 
            "Feb": {"Item_Name":["TV", "Smartphone", "Pendrive"],
                    "Item_Price":[90, 45, 12], 
                    "Item_Total": [48, 12, 8]}}
data_3d

In [ ]:
p2 = pnd.Panel(data=data_3d)
p2

<p>Обращение к таблицам <span style="font-weight:bold; color:green">Panel</span></p>

In [ ]:
p['Jan']

In [ ]:
p2['Jan']

In [ ]:
p['Feb']

In [ ]:
p2['Feb']

<a name="2"></a>
<div style="display:table; width:100%; padding-top:10px; padding-bottom:10px; border-bottom:1px solid lightgrey">
    <div style="display:table-row">
        <div style="display:table-cell; width:80%; font-size:14pt; font-weight:bold">2. Первые шаги с <span style="font-weight:bold; color:green">DataFrame</span></div>
    	<div style="display:table-cell; width:20%; text-align:center; background-color:whitesmoke; border:1px solid lightgrey"><a href="#0">К содержанию</a></div>
    </div>
</div>

<div>
<p><b>Рассматриваемые вопросы:</b></p>
<p style="line-height:20pt">
a) создание <span style="font-weight:bold; color:green">DataFrame</span>'а: <i>с использованием матрицы, списков, словаря, последовательностей</i><br> 
b) обращение к элементам<br> 
c) запись содержания <span style="font-weight:bold; color:green">DataFrame</span>'а во внешний файл: <i><b>csv</b> формат данных</i><br> 
d) загрузка внешних данных в <span style="font-weight:bold; color:green">DataFrame</span>: <i>обращение к ячейкам, изменение значений</i><br>
</div>

<a name="2a"></a>
<div style="padding-top:10px;">
    <div style="display: inline-block; font-style:italic; font-weight:bold; font-size:12pt">a. Создание <span style="font-weight:bold; color:green">DataFrame</span>'а</div>
    <div style="display: inline-block; float:right; width:20%; text-align:center; border:1px solid lightgrey">
        <div style="display: inline-block; text-align:center; width:50%; background-color:whitesmoke;"><a href="#2">Назад</a></div><div style="display: inline-block; text-align:center; width:50%;"><a href="#2b">Далее</a></div>
    </div>
</div>

<p>Создание <span style="font-weight:bold; color:green">DataFrame</span>'а с использованием <i>матрицы</i></p>

In [2]:
matrix = [['Dima', 'Moscow', 1988, 4, 'm'],
 ['Sveta', 'Kiev', 1999, 4, 'f'],
 ['Alex', 'Minsk', 1954, np.NaN, 'm'],
 ['Ivan', 'St.Petersburg', 2005, 6, 'm'],
 ['Kate', 'London', 2001, np.NaN, 'f'],
 ['Maria', 'New York', 1997, 7, 'f']]
matrix

[['Dima', 'Moscow', 1988, 4, 'm'],
 ['Sveta', 'Kiev', 1999, 4, 'f'],
 ['Alex', 'Minsk', 1954, nan, 'm'],
 ['Ivan', 'St.Petersburg', 2005, 6, 'm'],
 ['Kate', 'London', 2001, nan, 'f'],
 ['Maria', 'New York', 1997, 7, 'f']]

In [3]:
df = pnd.DataFrame(data=matrix, columns=["Name", "City", "Year", "Grade", "Gender"])
df

    Name           City  Year  Grade Gender
0   Dima         Moscow  1988    4.0      m
1  Sveta           Kiev  1999    4.0      f
2   Alex          Minsk  1954    NaN      m
3   Ivan  St.Petersburg  2005    6.0      m
4   Kate         London  2001    NaN      f
5  Maria       New York  1997    7.0      f

In [4]:
def init_df():
    return pnd.DataFrame(data=matrix, columns=["Name", "City", "Year", "Grade", "Gender"])

<p>Создание <span style="font-weight:bold; color:green">DataFrame</span>'а с использованием <i>списков</i> и <b>zip()</b></p>

In [ ]:
names = ["Dima", "Sveta","Alex", "Ivan", "Kate", "Maria"]
cities = ["Moscow", "Kiev", "Minsk", "St.Petersburg", "London", "New York"]
year = [1988, 1999, 1954, 2005, 2001, 1997]
grades = [4, 4, np.NaN, 6, np.NaN, 7]
gender = ["m", "f", "m", "m", "f", "f"]

rows = list(zip(names, cities, year, grades, gender))
rows

In [ ]:
df = pnd.DataFrame(data=rows, columns=["Name", "City", "Year", "Grade", "Gender"])
df

<p>Создание <span style="font-weight:bold; color:green">DataFrame</span>'а с использованием <i>списков</i> и <i>словаря</i></p>

In [ ]:
d_data = {"Name":["Dima", "Sveta","Alex", "Ivan", "Kate", "Maria"],
          "City":["Moscow", "Kiev", "Minsk", "St.Petersburg", "London", "New York"],
          "Year":[1988, 1999, 1954, 2005, 2001, 1997],
          "Grade":[4, 4, np.NaN, 6, np.NaN, 7],
          "Gender":["m", "f", "m", "m", "f", "f"]}
d_data

In [ ]:
df = pnd.DataFrame(data=d_data)
df

<p>Чтобы указать последовательность столбцов, следует воспользоваться параметром <i>columns</i></p>

In [ ]:
df = pnd.DataFrame(data=d_data, columns = ["Name", "Year", "City", "Grade", "Gender"])
df

<p>Создание <span style="font-weight:bold; color:green">DataFrame</span>'а с использованием <i>последовательностей</i></p>

In [ ]:
s1 = pnd.Series(data=["Dima", "Sveta", "Alex", "Ivan", "Kate", "Maria"], name="Name")
s2 = pnd.Series(data=["Moscow", "Kiev", "Minsk", "St.Petersburg", "London", "New York"], name="City")
s3 = pnd.Series(data=[1988, 1999, 1954, 2005, 2001, 1997], name="Year")
s4 = pnd.Series(data=[4, 4, np.NaN, 6, np.NaN, 7], name="Grade")
s5 = pnd.Series(data=['m', 'f', 'm', 'm', 'f', 'f'], name="Gender")

df1 = pnd.DataFrame([s1,s2,s3,s4,s5])
df1

In [ ]:
df1 = df1.T
df1

In [ ]:
df2 = pnd.DataFrame({"Name": s1.values, "City": s2.values, "Year": s3.values})
df2

Чтобы изменить стандартную индексацию от 0, можно воспользоваться следующим выражением

In [ ]:
df.index = df.index + 1  # индексация будет от 1
df

<p>Доступ к индексам</p>

In [ ]:
df.index

<p>Доступ к именам столбцов</p>

In [ ]:
df.columns

<a name="2b"></a>
<div style="padding-top:10px;">
    <div style="display: inline-block; font-style:italic; font-weight:bold; font-size:12pt">b. Обращение к элементам <span style="font-weight:bold; color:green">DataFrame</span></div>
    <div style="display: inline-block; float:right; width:20%; text-align:center; border:1px solid lightgrey">
        <div style="display: inline-block; text-align:center; width:50%; background-color:whitesmoke;"><a href="#2a">Назад</a></div><div style="display: inline-block; text-align:center; width:50%;"><a href="#2c">Далее</a></div>
    </div>
</div>

<p>Обращение к элементу по <b>индексу</b> строки и имени столбца</p>

In [ ]:
df.loc[2,"City"]

<p>Обращение к элементу по <b>номеру</b> строки и номеру столбца</p>

In [ ]:
df.iloc[2,2]

<a name="2c"></a>
<div style="padding-top:10px;">
    <div style="display: inline-block; font-style:italic; font-weight:bold; font-size:12pt">c. Запись содержания <span style="font-weight:bold; color:green">DataFrame</span> во внешний файл</div>
    <div style="display: inline-block; float:right; width:20%; text-align:center; border:1px solid lightgrey">
        <div style="display: inline-block; text-align:center; width:50%; background-color:whitesmoke;"><a href="#2b">Назад</a></div><div style="display: inline-block; text-align:center; width:50%;"><a href="#2d">Далее</a></div>
    </div>
</div>

<p>Pandas позволяет работать с различными форматами файлов, такими как csv, excel, xml, json и др. Более подробно <a href="https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html">здесь</a></p>
<p>В качестве примера далее рассматривается небольшой пример того, как значения <span style="font-weight:bold; color:green">DataFrame</span>'а записать во внешний файл csv, а затем загрузить из него данные обратно в <span style="font-weight:bold; color:green">DataFrame</span></p>

<p>Запись данных в файл <i>csv</i></p>

In [ ]:
df.to_csv("testFile.csv", index=False, header=True)

<a name="2d"></a>
<div style="padding-top:10px;">
    <div style="display: inline-block; font-style:italic; font-weight:bold; font-size:12pt">d. Загрузка внешних данных в <span style="font-weight:bold; color:green">DataFrame</span></div>
    <div style="display: inline-block; float:right; width:20%; text-align:center; border:1px solid lightgrey">
        <div style="display: inline-block; text-align:center; width:50%; background-color:whitesmoke;"><a href="#2c">Назад</a></div><div style="display: inline-block; text-align:center; width:50%;"><a href="#3">Далее</a></div>
    </div>
</div>

In [ ]:
df1 = pnd.read_csv("testFile.csv")
df1

<a name="3"></a>
<div style="padding-top:10px;">
    <div style="display: inline-block; font-size:14pt; font-weight:bold">3. Манипулирование <span style="font-weight:bold; color:green">DataFrame</span>'ми</div>
    <div style="display: inline-block; float:right; width:20%; text-align:center; background-color:whitesmoke; border:1px solid lightgrey"><a href="#0">К содержанию</a></div>
</div>

<div style="padding-bottom:10px; border-bottom:1px solid lightgrey"></div>

<div>
<p><b>Рассматриваемые вопросы:</b></p>
<p style="line-height:20pt">
a) работа со столбцами: <i>выбор данных по столбцам, добавление/удаление столбца</i><br> 
b) работа со строками: <i>выбор строк по индексу, использование условий, добавление/удаление строк</i><br> 
c) работа с ячейками: <i>обращение к ячейкам, изменение значений</i><br>
d) использованием метода groupby для группировки<br>
e) сортировка строк<br>
f) формирование сложных индексов<br>
g) объединение нескольких <span style="font-weight:bold; color:green">DataFrame</span>'ов: <i>append</i>, <i>concat</i>, <i>merge</i>, <i>join</i><br>
h) методы iterrows, map, apply, applymap
</p>
</div>

<a name="3a"></a>
<div style="padding-top:10px;">
    <div style="display: inline-block; font-style:italic; font-weight:bold; font-size:12pt">a. Столбцы</div>
    <div style="display: inline-block; float:right; width:20%; text-align:center; border:1px solid lightgrey">
        <div style="display: inline-block; text-align:center; width:50%; background-color:whitesmoke;"><a href="#3">Назад</a></div><div style="display: inline-block; text-align:center; width:50%;"><a href="#3b">Далее</a></div>
    </div>
</div>

<p>Исходный <span style="font-weight:bold; color:green">DataFrame</span></p>

In [ ]:
df

<p>Получение последовательности по имени столбца</p>

In [ ]:
s_name = df["Name"]
s_name

In [ ]:
s_name = df.Name
s_name

In [ ]:
type(s_name)

<p>Получение DataFrame по столбцу</p>

In [ ]:
df_name = df[["Name"]]  # обращение по имени столбца
df_name

In [ ]:
df_name = df[[df.columns[0]]]  # обращение по индексу столбца
df_name

In [ ]:
type(df_name)

<p>Использование нескольких столбцов для выбора данных</p>

In [ ]:
df_select = df[["Name", "City"]]
df_select

Получение уникальных значений столбца

In [ ]:
df.Name.unique()

In [ ]:
df.Gender.unique()

<p>Добавление/изменение столбца</p>

In [ ]:
df["NewColumn"] = [4, 5, 7, 3, 2, 6]  # добавление
df

In [ ]:
df["Grade"] = [1, 1, 1, 1, 1, 1]  # изменение
df

In [ ]:
df["Grade"] = [4, 4, np.NaN, 6, np.NaN, 7]
df

In [ ]:
if "NewColumn2" not in df.columns:
    df.insert(loc=1, value=[10,40,50,30,70,49], column="NewColumn2")  # loc - позиция столбца
df

<p>Создание из исходного <i>df</i> нового <span style="font-weight:bold; color:green">DataFrame</span>'а <i>df2</i> без столбца <i>NewColumn</i> </p>

In [ ]:
df2 = df.drop('NewColumn', axis=1, inplace=False)  # axis = 1 - удаление столбца
df2

In [ ]:
df

<p>Удаление столбцов из исходного <span style="font-weight:bold; color:green">DataFrame</span>'а</p>

In [ ]:
df.drop(["NewColumn", "NewColumn2"], axis=1, inplace=True)  # удаление нескольких столбцов
df

<a name="3b"></a>
<div style="padding-top:10px;">
    <div style="display: inline-block; font-style:italic; font-weight:bold; font-size:12pt">b. Строки</div>
    <div style="display: inline-block; float:right; width:20%; text-align:center; border:1px solid lightgrey">
        <div style="display: inline-block; text-align:center; width:50%; background-color:whitesmoke;"><a href="#3a">Назад</a></div><div style="display: inline-block; text-align:center; width:50%;"><a href="#3c">Далее</a></div>
    </div>
</div>

<p>Исходный <span style="font-weight:bold; color:green">DataFrame</span></p>

In [ ]:
df

<p>Выбор строк по <b>индексу</b></p>

In [ ]:
df.loc[2]

<p>Выбор строк по <b>позиции</b> (номер строки начиная с 0)</p>

In [ ]:
df.iloc[2]

Использование диапазона позиций

In [ ]:
df[:3]

In [ ]:
df[1:4]

<p>Использование условий</p>

In [ ]:
df[df.Name=="Dima"]

In [ ]:
df[df["Grade"]>=5]

In [ ]:
df[df.Grade>=5]

In [ ]:
df[(df.Grade>=5) & (df.Gender=="f")]  # операция "И"

In [ ]:
df[(df.Grade==4) | (df.Grade==6)]  # операция "ИЛИ"

In [ ]:
cond = (df.Grade==4) | (df.Grade==6)

In [ ]:
df[cond]

In [ ]:
df[np.isnan(df.Grade)]  # строки с неопредленным значнием Grade

<p>Применение метода <b>isin()</b> для вывода строк, в которых значение заданного столбца содержится в списке</p>

In [ ]:
l_cities = ["Moscow", "Minsk"]
df2 = df[df.City.isin(l_cities)]
df2

<p>Добавление/изменение строки</p>

In [ ]:
df.loc[10] = ["NewName", "NewCity", 2016, 1, "f"]  # добавление строки с указанием индекса
df

In [ ]:
df.loc[4] = ["ChangedIvan", "St.Petersburg", 2005, 6, "m"]  # изменение строки с указанием её номера
df

In [ ]:
df.iloc[0] = ["Changed", "Changed", 2000, 10, "m"]  # изменение строки по индексу строки
df

Метод <b>fillna()</b> заполняет пустые ячейки значением аргумента

In [ ]:
df4 = df["Grade"].fillna(-1)  # возвращает новый DataFrame
pnd.DataFrame(df4)

<p>Удаление строки</p>

In [ ]:
# Удаление по номеру строки, axis = 0 - строки, inplace = True - удаляет в df
df.drop(df.index[6], axis=0, inplace=True)
df

In [ ]:
df.drop(df.index[df.index==10], axis = 0, inplace = True)  # удаление по индексу строки
df

In [ ]:
df2 = df.drop(df.index[df.index==1], axis = 0, inplace = False)
df2

In [ ]:
df

<p>Удаление всех строк, в которых есть неопределенное значение (NaN)</p>

In [ ]:
df.dropna()  # возвращает новый DataFrame

<a name="3c"></a>
<div style="padding-top:10px;">
    <div style="display: inline-block; font-style:italic; font-weight:bold; font-size:12pt">c. Значения ячеек</div>
    <div style="display: inline-block; float:right; width:20%; text-align:center; border:1px solid lightgrey">
        <div style="display: inline-block; text-align:center; width:50%; background-color:whitesmoke;"><a href="#3b">Назад</a></div><div style="display: inline-block; text-align:center; width:50%;"><a href="#3d">Далее</a></div>
    </div>
</div>

<p>Обращение по <b>индексу</b> строки</p>

In [ ]:
df.loc[2, "City"]

<p>Обращение по <b>позиции</b> (номеру) строки</p>

In [ ]:
df.iloc[2, 1]

<p>Пример использования с циклом <i>for</i></p>

In [ ]:
#Изменение значений в столбце Grade на +10
for i in range(len(df)):
    df.iloc[i, 3] += 10
df

<p>Срезы по строкам</p>

In [ ]:
df.loc[:,"City"]

In [ ]:
df.iloc[1:4, 1]

<p>Срезы по строкам и столбцам</p>

In [ ]:
df.loc[1:4,"Name":"City"]

In [ ]:
df

<p>Изменение значения ячейки. Если нет указанного индекса в <span style="font-weight:bold; color:green">DataFrame</span>'е, то добавляется новая строка</p>

In [ ]:
df.at[10, "Name"] = "NewName"
df

In [ ]:
df.iat[2, 0] = "NewName"
df

In [ ]:
df.drop(df.index[df.index==10], axis = 0, inplace = True) # удаление по индексу строки
df

<a name="3d"></a>
<div style="padding-top:10px;">
    <div style="display: inline-block; font-style:italic; font-weight:bold; font-size:12pt">d. Группировка</div>
    <div style="display: inline-block; float:right; width:20%; text-align:center; border:1px solid lightgrey">
        <div style="display: inline-block; text-align:center; width:50%; background-color:whitesmoke;"><a href="#3c">Назад</a></div><div style="display: inline-block; text-align:center; width:50%;"><a href="#3e">Далее</a></div>
    </div>
</div>

In [ ]:
df = init_df()
df

In [ ]:
salary = [10, 40, 50, 30, 70, 49]
marital_status = [True, False, True, True, True, False]
df_group = df.copy()
df_group["Salary"] = salary
df_group["Marriage"] = marital_status
df_group

<p>Итеративный объект с группами по значению столбца</p>

In [ ]:
groupby = df_group.groupby("Gender")
groupby

<p>Использование цикла <i>for</i> для доступа к группам</p>

In [ ]:
for i, group in groupby:
    print(i)
    print(group)

<p>Количество строк в каждой группе</p>

In [ ]:
groupby.size()

<p>Группировка по нескольким столбцам</p>

In [ ]:
groupby_2 = df_group.groupby(["Gender","Marriage"])
groupby_2

In [ ]:
for i, group in groupby_2:
    print(i)
    print(group)

<p>Получение <span style="font-weight:bold; color:green">DataFrame</span>'а группы по значению</p>

In [ ]:
df2 = groupby.get_group("f")
df2

In [ ]:
groupby_2.get_group(('f', False))

<p>Фильтр для групп</p>

In [ ]:
# Возвращает DataFrame с группами, в которых сумма Grade > 10
df_group.groupby("Gender").filter(lambda group: group.Grade.sum() > 10)

<p>Агрегирование в группах</p>

In [ ]:
df2 = df_group[["Gender", "Grade", "Salary"]]
df2

In [ ]:
df2.groupby("Gender").aggregate(lambda group: group.sum())

<p>Трансформация выполняется для элементов отдельных столбцов каждой группы</p>

In [ ]:
v = np.array([1,2,3])
v - v.mean()

In [ ]:
df2

In [ ]:
# Значение элемента минус среднее значение в столбце группы
# [1,2,3]-2 = [-1,0,1]
df2.groupby("Gender").transform(lambda x: x - x.mean())

<p>Группировка данных по диапазонам значений</p>

In [ ]:
sal = pnd.cut(df_group.Salary, bins=[0, 30, 50, 80])
sal

In [ ]:
interval = pnd.Interval(left=30, right=50, closed="right")

In [ ]:
gr3 = df_group.groupby(sal)
gr3.get_group(interval)

In [ ]:
sal2 = pnd.cut(df_group.Salary, bins=[0, 30, 50, 80], labels=["bad", "medium", "good"])
sal2

In [ ]:
gr3 = df_group.groupby(sal2)
gr3.get_group("medium")

In [ ]:
sal3 = pnd.cut(df_group.Salary, np.arange(0, 100, 10))
sal3

In [ ]:
sal4 = pnd.cut(df_group.Salary, 3, labels=["bad","medium","good"])
sal4

<a name="3e"></a>
<div style="padding-top:10px;">
    <div style="display: inline-block; font-style:italic; font-weight:bold; font-size:12pt">e. Сортировка</div>
    <div style="display: inline-block; float:right; width:20%; text-align:center; border:1px solid lightgrey">
        <div style="display: inline-block; text-align:center; width:50%; background-color:whitesmoke;"><a href="#3d">Назад</a></div><div style="display: inline-block; text-align:center; width:50%;"><a href="#3f">Далее</a></div>
    </div>
</div>

<p>Сортировка по одному столбцу</p>

In [ ]:
df.sort_values("Year", ascending=1)  # по возрастанию

In [ ]:
df.sort_values("Year", ascending=0)  # по убыванию

<p>Сортировка по нескольким столбцам</p>

In [ ]:
df.sort_values(["Gender", "Year"], ascending=[1, 0])

<a name="3f"></a>
<div style="padding-top:10px;">
    <div style="display: inline-block; font-style:italic; font-weight:bold; font-size:12pt">f. Сложные индексы</div>
    <div style="display: inline-block; float:right; width:20%; text-align:center; border:1px solid lightgrey">
        <div style="display: inline-block; text-align:center; width:50%; background-color:whitesmoke;"><a href="#3e">Назад</a></div><div style="display: inline-block; text-align:center; width:50%;"><a href="#3g">Далее</a></div>
    </div>
</div>

In [ ]:
data =  np.random.randint(low=0, high=101, size=(4,3))
data

In [ ]:
index2 = ["Working Days", "Weekend", "Working Days", "Weekend"]  # второй индекс
index1 = ["Week1", "Week1", "Week2", "Week2"]  # первый индекс

df = pnd.DataFrame(data=data, columns=["TV", "Smartphone", "Pendrive"], index=[index1, index2])
df

<p>Доступ к данный по индексам</p>

In [ ]:
df.loc["Week1"]

In [ ]:
df.loc[("Week1", "Weekend")]

<p>Пример с суммой</p>

In [ ]:
df.sum()  # сумма по столбцам для всех индексов

In [ ]:
df.loc["Week1"].sum()  # сумма по столбцам для Week1

In [ ]:
# Сумма по столбцам за Weekend для Week1 и Week2
df.loc[[("Week1", "Weekend"),("Week2", "Weekend")]].sum()

<a name="3g"></a>
<div style="padding-top:10px;">
    <div style="display: inline-block; font-style:italic; font-weight:bold; font-size:12pt">g. Объединение DataFrame'ов</div>
    <div style="display: inline-block; float:right; width:20%; text-align:center; border:1px solid lightgrey">
        <div style="display: inline-block; text-align:center; width:50%; background-color:whitesmoke;"><a href="#3f">Назад</a></div><div style="display: inline-block; text-align:center; width:50%;"><a href="#3h">Далее</a></div>
    </div>
</div>

<p>Слияние таблиц</p>

<p><b>Метод <i>append()</i></b> - объединение строк таблиц</p>

In [9]:
# Загрузка начальной версии df
df = init_df()
df

    Name           City  Year  Grade Gender
0   Dima         Moscow  1988    4.0      m
1  Sveta           Kiev  1999    4.0      f
2   Alex          Minsk  1954    NaN      m
3   Ivan  St.Petersburg  2005    6.0      m
4   Kate         London  2001    NaN      f
5  Maria       New York  1997    7.0      f

<p>Использование списка словарей</p>

In [10]:
dict_new = [{"Name":"Petr", "City":"Bryansk", "Year":1990, "Grade":8}, {"Name":"Ann", "City":"Tehran"}]
dict_new

[{'Name': 'Petr', 'City': 'Bryansk', 'Year': 1990, 'Grade': 8},
 {'Name': 'Ann', 'City': 'Tehran'}]

In [11]:
# ignore_index = True - в новом DataFrame будет стандартная индексация от 0.
df2 = df.append(dict_new, ignore_index=True)
df2

    Name           City    Year  Grade Gender
0   Dima         Moscow  1988.0    4.0      m
1  Sveta           Kiev  1999.0    4.0      f
2   Alex          Minsk  1954.0    NaN      m
3   Ivan  St.Petersburg  2005.0    6.0      m
4   Kate         London  2001.0    NaN      f
5  Maria       New York  1997.0    7.0      f
6   Petr        Bryansk  1990.0    8.0    NaN
7    Ann         Tehran     NaN    NaN    NaN

<p>Последовательность</p>

In [12]:
s1 = pnd.Series(data=["Petr", "Bryansk", 1978, 5, "m"], index=["Name", "City", "Year", "Grade", "Gender"])
s2 = pnd.Series(data=["Ann", "Tehran", 1997, 7, "f"], index=["Name", "City", "Year", "Grade", "Gender"])

In [13]:
df2 = df.append([s1,s2], ignore_index=True)
df2

    Name           City  Year  Grade Gender
0   Dima         Moscow  1988    4.0      m
1  Sveta           Kiev  1999    4.0      f
2   Alex          Minsk  1954    NaN      m
3   Ivan  St.Petersburg  2005    6.0      m
4   Kate         London  2001    NaN      f
5  Maria       New York  1997    7.0      f
6   Petr        Bryansk  1978    5.0      m
7    Ann         Tehran  1997    7.0      f

<p><b>Функция <i>concat()</i></b></p>

<p>Объединение строк</p>

In [14]:
rows_new = [["Petr", "Bryansk", 1978, 5, "m"], ["Ann", "Tehran", 1997, 7, "f"]]
rows_new

[['Petr', 'Bryansk', 1978, 5, 'm'], ['Ann', 'Tehran', 1997, 7, 'f']]

In [15]:
df2 = pnd.DataFrame(data=rows_new, columns=["Name","City","Year","Grade","Gender"])
df2

   Name     City  Year  Grade Gender
0  Petr  Bryansk  1978      5      m
1   Ann   Tehran  1997      7      f

In [16]:
df3 = pnd.concat([df, df2], ignore_index=False)
df3

    Name           City  Year  Grade Gender
0   Dima         Moscow  1988    4.0      m
1  Sveta           Kiev  1999    4.0      f
2   Alex          Minsk  1954    NaN      m
3   Ivan  St.Petersburg  2005    6.0      m
4   Kate         London  2001    NaN      f
5  Maria       New York  1997    7.0      f
0   Petr        Bryansk  1978    5.0      m
1    Ann         Tehran  1997    7.0      f

In [17]:
df3.loc[1]

    Name    City  Year  Grade Gender
1  Sveta    Kiev  1999    4.0      f
1    Ann  Tehran  1997    7.0      f

In [18]:
df3 = pnd.concat([df, df2], ignore_index=True)
df3

    Name           City  Year  Grade Gender
0   Dima         Moscow  1988    4.0      m
1  Sveta           Kiev  1999    4.0      f
2   Alex          Minsk  1954    NaN      m
3   Ivan  St.Petersburg  2005    6.0      m
4   Kate         London  2001    NaN      f
5  Maria       New York  1997    7.0      f
6   Petr        Bryansk  1978    5.0      m
7    Ann         Tehran  1997    7.0      f

<p>Добавление ключа/индекса</p>

In [19]:
df3 = pnd.concat([df, df2], keys=["Table1", "Table2"])
df3

           Name           City  Year  Grade Gender
Table1 0   Dima         Moscow  1988    4.0      m
       1  Sveta           Kiev  1999    4.0      f
       2   Alex          Minsk  1954    NaN      m
       3   Ivan  St.Petersburg  2005    6.0      m
       4   Kate         London  2001    NaN      f
       5  Maria       New York  1997    7.0      f
Table2 0   Petr        Bryansk  1978    5.0      m
       1    Ann         Tehran  1997    7.0      f

In [20]:
df3.loc["Table1"]

    Name           City  Year  Grade Gender
0   Dima         Moscow  1988    4.0      m
1  Sveta           Kiev  1999    4.0      f
2   Alex          Minsk  1954    NaN      m
3   Ivan  St.Petersburg  2005    6.0      m
4   Kate         London  2001    NaN      f
5  Maria       New York  1997    7.0      f

In [21]:
df3.loc[("Table1", 1)]

Name      Sveta
City       Kiev
Year       1999
Grade         4
Gender        f
Name: (Table1, 1), dtype: object

<p>Слияние таблиц по столбцам</p>

In [22]:
df

    Name           City  Year  Grade Gender
0   Dima         Moscow  1988    4.0      m
1  Sveta           Kiev  1999    4.0      f
2   Alex          Minsk  1954    NaN      m
3   Ivan  St.Petersburg  2005    6.0      m
4   Kate         London  2001    NaN      f
5  Maria       New York  1997    7.0      f

In [23]:
dict_new = {"Marriage_status":[True, False, True, False],
            "Salary":[12, 40, 53, 25]}

df_right_1 = pnd.DataFrame(data=dict_new)
df_right_1

   Marriage_status  Salary
0             True      12
1            False      40
2             True      53
3            False      25

<p>Внешнее соединение (<b>outer join</b>) таблиц по индексу</p>

In [24]:
# axis = 1 указывает на то, что будет объединение столбцов
df3 = pnd.concat([df, df_right_1], axis=1, join="outer")
df3

    Name           City  Year  Grade Gender Marriage_status  Salary
0   Dima         Moscow  1988    4.0      m            True    12.0
1  Sveta           Kiev  1999    4.0      f           False    40.0
2   Alex          Minsk  1954    NaN      m            True    53.0
3   Ivan  St.Petersburg  2005    6.0      m           False    25.0
4   Kate         London  2001    NaN      f             NaN     NaN
5  Maria       New York  1997    7.0      f             NaN     NaN

<p>Внутреннее соединение (<b>inner join</b>) таблиц по индексу</p>

In [25]:
# join = "inner" - объединяет столбцы по совпадающим индексам строк
df3 = pnd.concat([df, df_right_1], axis=1, join="inner")
df3

    Name           City  Year  Grade Gender  Marriage_status  Salary
0   Dima         Moscow  1988    4.0      m             True      12
1  Sveta           Kiev  1999    4.0      f            False      40
2   Alex          Minsk  1954    NaN      m             True      53
3   Ivan  St.Petersburg  2005    6.0      m            False      25

<p><b>Функция <i>merge()</i></b></p>

<p>Внешнее соединение (<b>outer join</b>) таблиц по индексу</p>

In [26]:
df3 = pnd.merge(df, df_right_1, left_index=True, right_index=True, how="outer")
df3

    Name           City  Year  Grade Gender Marriage_status  Salary
0   Dima         Moscow  1988    4.0      m            True    12.0
1  Sveta           Kiev  1999    4.0      f           False    40.0
2   Alex          Minsk  1954    NaN      m            True    53.0
3   Ivan  St.Petersburg  2005    6.0      m           False    25.0
4   Kate         London  2001    NaN      f             NaN     NaN
5  Maria       New York  1997    7.0      f             NaN     NaN

<p>Внешнее соединение (<b>outer join</b>) таблиц по значениям в столбцах</p>

In [27]:
dict_new_2 = {"Name":["Sveta", "Sveta", "Alex", "Alex", "Kate", "Vlad", "Alice"],
            "Device":["TV", "Smartphone", "TV", "Pendrive", "TV", "TV", "PC"]}

df_right_2 = pnd.DataFrame(data=dict_new_2)
df_right_2

    Name      Device
0  Sveta          TV
1  Sveta  Smartphone
2   Alex          TV
3   Alex    Pendrive
4   Kate          TV
5   Vlad          TV
6  Alice          PC

In [28]:
df3 = pnd.merge(df, df_right_2, on=["Name"], how="outer")
df3

    Name           City    Year  Grade Gender      Device
0   Dima         Moscow  1988.0    4.0      m         NaN
1  Sveta           Kiev  1999.0    4.0      f          TV
2  Sveta           Kiev  1999.0    4.0      f  Smartphone
3   Alex          Minsk  1954.0    NaN      m          TV
4   Alex          Minsk  1954.0    NaN      m    Pendrive
5   Ivan  St.Petersburg  2005.0    6.0      m         NaN
6   Kate         London  2001.0    NaN      f          TV
7  Maria       New York  1997.0    7.0      f         NaN
8   Vlad            NaN     NaN    NaN    NaN          TV
9  Alice            NaN     NaN    NaN    NaN          PC

<p>Внешнее соединение (<b>outer join</b>) таблиц по значениям столбцов одной таблицы и индексам другой</p>

In [33]:
dict_new_3 = {"key":[2, 2, 3, 3, 4, 4, 10],
            "Device":["TV", "Smartphone", "TV", "Pendrive", "TV", "TV", "PC"]}

df_left = pnd.DataFrame(data=dict_new_3)
df_left

   key      Device
0    2          TV
1    2  Smartphone
2    3          TV
3    3    Pendrive
4    4          TV
5    4          TV
6   10          PC

In [34]:
df3 = pnd.merge(df_left, df, left_on="key", right_index=True, how="outer")
df3

     key      Device   Name           City    Year  Grade Gender
0.0    2          TV   Alex          Minsk  1954.0    NaN      m
1.0    2  Smartphone   Alex          Minsk  1954.0    NaN      m
2.0    3          TV   Ivan  St.Petersburg  2005.0    6.0      m
3.0    3    Pendrive   Ivan  St.Petersburg  2005.0    6.0      m
4.0    4          TV   Kate         London  2001.0    NaN      f
5.0    4          TV   Kate         London  2001.0    NaN      f
6.0   10          PC    NaN            NaN     NaN    NaN    NaN
NaN    0         NaN   Dima         Moscow  1988.0    4.0      m
NaN    1         NaN  Sveta           Kiev  1999.0    4.0      f
NaN    5         NaN  Maria       New York  1997.0    7.0      f

<p>Левое внешнее соединение (<b>left outer join</b>) таблиц по индексу</p>

In [35]:
df3 = pnd.merge(df, df_right_1, left_index=True, right_index=True, how="left")
df3

    Name           City  Year  Grade Gender Marriage_status  Salary
0   Dima         Moscow  1988    4.0      m            True    12.0
1  Sveta           Kiev  1999    4.0      f           False    40.0
2   Alex          Minsk  1954    NaN      m            True    53.0
3   Ivan  St.Petersburg  2005    6.0      m           False    25.0
4   Kate         London  2001    NaN      f             NaN     NaN
5  Maria       New York  1997    7.0      f             NaN     NaN

<p>Левое внешнее соединение (<b>left outer join</b>) таблиц по значениям в столбцах</p>

In [36]:
df3 = pnd.merge(df, df_right_2, on=["Name"], how="left")
df3

    Name           City  Year  Grade Gender      Device
0   Dima         Moscow  1988    4.0      m         NaN
1  Sveta           Kiev  1999    4.0      f          TV
2  Sveta           Kiev  1999    4.0      f  Smartphone
3   Alex          Minsk  1954    NaN      m          TV
4   Alex          Minsk  1954    NaN      m    Pendrive
5   Ivan  St.Petersburg  2005    6.0      m         NaN
6   Kate         London  2001    NaN      f          TV
7  Maria       New York  1997    7.0      f         NaN

<p>Внешнее левое соединение (<b>left outer join</b>) таблиц по значениям столбцов одной таблицы и индексам другой</p>

In [37]:
df3 = pnd.merge(dfLeft, df, left_on="key", right_index=True, how="left")
df3

   key      Device  Name           City    Year  Grade Gender
0    2          TV  Alex          Minsk  1954.0    NaN      m
1    2  Smartphone  Alex          Minsk  1954.0    NaN      m
2    3          TV  Ivan  St.Petersburg  2005.0    6.0      m
3    3    Pendrive  Ivan  St.Petersburg  2005.0    6.0      m
4    4          TV  Kate         London  2001.0    NaN      f
5    4          TV  Kate         London  2001.0    NaN      f
6   10          PC   NaN            NaN     NaN    NaN    NaN

<p>Правое внешнее соединение (<b>right outer join</b>) таблиц по индексу</p>

In [38]:
df3 = pnd.merge(df, df_right_1, left_index=True, right_index=True, how="right")
df3

    Name           City  Year  Grade Gender  Marriage_status  Salary
0   Dima         Moscow  1988    4.0      m             True      12
1  Sveta           Kiev  1999    4.0      f            False      40
2   Alex          Minsk  1954    NaN      m             True      53
3   Ivan  St.Petersburg  2005    6.0      m            False      25

<p>Правое внешнее соединение (<b>right outer join</b>) таблиц по значениям в столбцах</p>

In [39]:
df3 = pnd.merge(df, df_right_2, on=["Name"], how="right")
df3

    Name    City    Year  Grade Gender      Device
0  Sveta    Kiev  1999.0    4.0      f          TV
1  Sveta    Kiev  1999.0    4.0      f  Smartphone
2   Alex   Minsk  1954.0    NaN      m          TV
3   Alex   Minsk  1954.0    NaN      m    Pendrive
4   Kate  London  2001.0    NaN      f          TV
5   Vlad     NaN     NaN    NaN    NaN          TV
6  Alice     NaN     NaN    NaN    NaN          PC

In [40]:
df3 = pnd.merge(df, df_right_2, on=["Name"], how="right")
df3

    Name    City    Year  Grade Gender      Device
0  Sveta    Kiev  1999.0    4.0      f          TV
1  Sveta    Kiev  1999.0    4.0      f  Smartphone
2   Alex   Minsk  1954.0    NaN      m          TV
3   Alex   Minsk  1954.0    NaN      m    Pendrive
4   Kate  London  2001.0    NaN      f          TV
5   Vlad     NaN     NaN    NaN    NaN          TV
6  Alice     NaN     NaN    NaN    NaN          PC

<p>Внешнее правое соединение (<b>right outer join</b>) таблиц по значениям столбцов одной таблицы и индексам другой</p>

In [41]:
df3 = pnd.merge(df_left, df, left_on="key", right_index=True, how="right")
df3

     key      Device   Name           City  Year  Grade Gender
0.0    2          TV   Alex          Minsk  1954    NaN      m
1.0    2  Smartphone   Alex          Minsk  1954    NaN      m
2.0    3          TV   Ivan  St.Petersburg  2005    6.0      m
3.0    3    Pendrive   Ivan  St.Petersburg  2005    6.0      m
4.0    4          TV   Kate         London  2001    NaN      f
5.0    4          TV   Kate         London  2001    NaN      f
NaN    0         NaN   Dima         Moscow  1988    4.0      m
NaN    1         NaN  Sveta           Kiev  1999    4.0      f
NaN    5         NaN  Maria       New York  1997    7.0      f

<p>Внутреннее соединение (<b>inner join</b>) таблиц по индексу</p>

In [42]:
df3 = pnd.merge(df, df_right_1, left_index=True, right_index=True, how="inner")
df3

    Name           City  Year  Grade Gender  Marriage_status  Salary
0   Dima         Moscow  1988    4.0      m             True      12
1  Sveta           Kiev  1999    4.0      f            False      40
2   Alex          Minsk  1954    NaN      m             True      53
3   Ivan  St.Petersburg  2005    6.0      m            False      25

<p>Внутреннее соединение (<b>inner join</b>) таблиц по значениям в столбцах</p>

In [43]:
df3 = pnd.merge(df, df_right_2, on = ["Name"], how = "inner")
df3

    Name    City  Year  Grade Gender      Device
0  Sveta    Kiev  1999    4.0      f          TV
1  Sveta    Kiev  1999    4.0      f  Smartphone
2   Alex   Minsk  1954    NaN      m          TV
3   Alex   Minsk  1954    NaN      m    Pendrive
4   Kate  London  2001    NaN      f          TV

<p>Внутреннее соединение (<b>inner join</b>) таблиц по значениям столбцов одной таблицы и индексам другой</p>

In [44]:
df3 = pnd.merge(df_left, df, left_on="key", right_index=True, how="inner")
df3

   key      Device  Name           City  Year  Grade Gender
0    2          TV  Alex          Minsk  1954    NaN      m
1    2  Smartphone  Alex          Minsk  1954    NaN      m
2    3          TV  Ivan  St.Petersburg  2005    6.0      m
3    3    Pendrive  Ivan  St.Petersburg  2005    6.0      m
4    4          TV  Kate         London  2001    NaN      f
5    4          TV  Kate         London  2001    NaN      f

<p><b>Метод <i>join()</i></b></p>

<p>Внешнее соединение (<b>outer join</b>) таблиц по индексу</p>

In [45]:
df

    Name           City  Year  Grade Gender
0   Dima         Moscow  1988    4.0      m
1  Sveta           Kiev  1999    4.0      f
2   Alex          Minsk  1954    NaN      m
3   Ivan  St.Petersburg  2005    6.0      m
4   Kate         London  2001    NaN      f
5  Maria       New York  1997    7.0      f

In [46]:
df2

   Name     City  Year  Grade Gender
0  Petr  Bryansk  1978      5      m
1   Ann   Tehran  1997      7      f

In [47]:
df3 = df.join(df_right_1, how="outer")
df3

    Name           City  Year  Grade Gender Marriage_status  Salary
0   Dima         Moscow  1988    4.0      m            True    12.0
1  Sveta           Kiev  1999    4.0      f           False    40.0
2   Alex          Minsk  1954    NaN      m            True    53.0
3   Ivan  St.Petersburg  2005    6.0      m           False    25.0
4   Kate         London  2001    NaN      f             NaN     NaN
5  Maria       New York  1997    7.0      f             NaN     NaN

<p>Внешнее соединение (<b>outer join</b>) таблиц по значениям столбцов одной таблицы и индексам другой</p>

In [48]:
dict_new_3 = {"key":[2, 2, 3, 3, 4, 4, 10],
              "Device":["TV", "Smartphone", "TV", "Pendrive", "TV", "TV", "PC"]}

df_left = pnd.DataFrame(data=dict_new_3)
df_left

   key      Device
0    2          TV
1    2  Smartphone
2    3          TV
3    3    Pendrive
4    4          TV
5    4          TV
6   10          PC

In [49]:
df3 = df_left.join(df, on="key", how="outer")
df3

     key      Device   Name           City    Year  Grade Gender
0.0    2          TV   Alex          Minsk  1954.0    NaN      m
1.0    2  Smartphone   Alex          Minsk  1954.0    NaN      m
2.0    3          TV   Ivan  St.Petersburg  2005.0    6.0      m
3.0    3    Pendrive   Ivan  St.Petersburg  2005.0    6.0      m
4.0    4          TV   Kate         London  2001.0    NaN      f
5.0    4          TV   Kate         London  2001.0    NaN      f
6.0   10          PC    NaN            NaN     NaN    NaN    NaN
NaN    0         NaN   Dima         Moscow  1988.0    4.0      m
NaN    1         NaN  Sveta           Kiev  1999.0    4.0      f
NaN    5         NaN  Maria       New York  1997.0    7.0      f

<p>Левое внешнее соединение (<b>left outer join</b>) таблиц по индексу</p>

In [50]:
df3 = df.join(df_right_1, how="left")
df3

    Name           City  Year  Grade Gender Marriage_status  Salary
0   Dima         Moscow  1988    4.0      m            True    12.0
1  Sveta           Kiev  1999    4.0      f           False    40.0
2   Alex          Minsk  1954    NaN      m            True    53.0
3   Ivan  St.Petersburg  2005    6.0      m           False    25.0
4   Kate         London  2001    NaN      f             NaN     NaN
5  Maria       New York  1997    7.0      f             NaN     NaN

<p>Внешнее левое соединение (<b>left outer join</b>) таблиц по значениям столбцов одной таблицы и индексам другой</p>

In [51]:
df3 = df_left.join(df, on="key", how="left")
df3

   key      Device  Name           City    Year  Grade Gender
0    2          TV  Alex          Minsk  1954.0    NaN      m
1    2  Smartphone  Alex          Minsk  1954.0    NaN      m
2    3          TV  Ivan  St.Petersburg  2005.0    6.0      m
3    3    Pendrive  Ivan  St.Petersburg  2005.0    6.0      m
4    4          TV  Kate         London  2001.0    NaN      f
5    4          TV  Kate         London  2001.0    NaN      f
6   10          PC   NaN            NaN     NaN    NaN    NaN

<p>Правое внешнее соединение (<b>right outer join</b>) таблиц по индексу</p>

In [52]:
df3 = df.join(df_right_1, how="right")
df3

    Name           City  Year  Grade Gender  Marriage_status  Salary
0   Dima         Moscow  1988    4.0      m             True      12
1  Sveta           Kiev  1999    4.0      f            False      40
2   Alex          Minsk  1954    NaN      m             True      53
3   Ivan  St.Petersburg  2005    6.0      m            False      25

<p>Внешнее правое соединение (<b>right outer join</b>) таблиц по значениям столбцов одной таблицы и индексам другой</p>

In [53]:
df3 = df_left.join(df, on="key", how="right")
df3

     key      Device   Name           City  Year  Grade Gender
0.0    2          TV   Alex          Minsk  1954    NaN      m
1.0    2  Smartphone   Alex          Minsk  1954    NaN      m
2.0    3          TV   Ivan  St.Petersburg  2005    6.0      m
3.0    3    Pendrive   Ivan  St.Petersburg  2005    6.0      m
4.0    4          TV   Kate         London  2001    NaN      f
5.0    4          TV   Kate         London  2001    NaN      f
NaN    0         NaN   Dima         Moscow  1988    4.0      m
NaN    1         NaN  Sveta           Kiev  1999    4.0      f
NaN    5         NaN  Maria       New York  1997    7.0      f

<p>Внутреннее соединение (<b>inner join</b>) таблиц по индексу</p>

In [54]:
df3 = df.join(df_right_1, how="inner")
df3

    Name           City  Year  Grade Gender  Marriage_status  Salary
0   Dima         Moscow  1988    4.0      m             True      12
1  Sveta           Kiev  1999    4.0      f            False      40
2   Alex          Minsk  1954    NaN      m             True      53
3   Ivan  St.Petersburg  2005    6.0      m            False      25

<p>Внутреннее соединение (<b>inner join</b>) таблиц по значениям столбцов одной таблицы и индексам другой</p>

In [55]:
df3 = df_left.join(df, on="key", how="inner")
df3

   key      Device  Name           City  Year  Grade Gender
0    2          TV  Alex          Minsk  1954    NaN      m
1    2  Smartphone  Alex          Minsk  1954    NaN      m
2    3          TV  Ivan  St.Petersburg  2005    6.0      m
3    3    Pendrive  Ivan  St.Petersburg  2005    6.0      m
4    4          TV  Kate         London  2001    NaN      f
5    4          TV  Kate         London  2001    NaN      f

<a name="3h"></a>
<div style="padding-top:10px;">
    <div style="display: inline-block; font-style:italic; font-weight:bold; font-size:12pt">h. Методы <i>iterrows</i>, <i>map</i>, <i>apply</i>, <i>applymap</i></div>
    <div style="display: inline-block; float:right; width:20%; text-align:center; border:1px solid lightgrey">
        <div style="display: inline-block; text-align:center; width:50%; background-color:whitesmoke;"><a href="#3g">Назад</a></div><div style="display: inline-block; text-align:center; width:50%;"><a href="#4">Далее</a></div>
    </div>
</div>

<p>Использование итератора по строкам - метод <b>iterrows()</b></p>

In [56]:
for i, row in df.iterrows():
    print(i)
    print(row)

0
Name        Dima
City      Moscow
Year        1988
Grade          4
Gender         m
Name: 0, dtype: object
1
Name      Sveta
City       Kiev
Year       1999
Grade         4
Gender        f
Name: 1, dtype: object
2
Name       Alex
City      Minsk
Year       1954
Grade       NaN
Gender        m
Name: 2, dtype: object
3
Name               Ivan
City      St.Petersburg
Year               2005
Grade                 6
Gender                m
Name: 3, dtype: object
4
Name        Kate
City      London
Year        2001
Grade        NaN
Gender         f
Name: 4, dtype: object
5
Name         Maria
City      New York
Year          1997
Grade            7
Gender           f
Name: 5, dtype: object

<p>Пример</p>

In [57]:
df2 = pnd.DataFrame(columns=df.columns)  # новый DataFrame со схемой (столбцами) df
for i, row in df.iterrows():
    # Если City есть Moscow или Minsk, строка row добавляется в df2
    if row.City in ["Moscow", "Minsk"]:
        df2.loc[i] = row
        
df2

   Name    City  Year  Grade Gender
0  Dima  Moscow  1988    4.0      m
2  Alex   Minsk  1954    NaN      m

<p>Выбор/фильтрация строк посредством методов <b>apply()</b> и <b>map()</b></p>

In [58]:
df2 = df[df["City"].apply(lambda c: c in ["Moscow", "Minsk"])]
df2

   Name    City  Year  Grade Gender
0  Dima  Moscow  1988    4.0      m
2  Alex   Minsk  1954    NaN      m

In [59]:
# Через функцию (без lambda)
def func(city):
    if city in ["Moscow", "Minsk"]:
        return True
    return False

df2 = df[df.City.apply(func)]
df2

   Name    City  Year  Grade Gender
0  Dima  Moscow  1988    4.0      m
2  Alex   Minsk  1954    NaN      m

<p>Выбор строк без нулевых значений</p>

In [60]:
df[df.Grade.notnull()]

    Name           City  Year  Grade Gender
0   Dima         Moscow  1988    4.0      m
1  Sveta           Kiev  1999    4.0      f
3   Ivan  St.Petersburg  2005    6.0      m
5  Maria       New York  1997    7.0      f

In [61]:
df[df.Grade.apply(lambda x: not np.isnan(x))]

    Name           City  Year  Grade Gender
0   Dima         Moscow  1988    4.0      m
1  Sveta           Kiev  1999    4.0      f
3   Ivan  St.Petersburg  2005    6.0      m
5  Maria       New York  1997    7.0      f

<p>Выбор строк с условием Year > 2000</p>

In [62]:
df[df["Year"]>=2000]

   Name           City  Year  Grade Gender
3  Ivan  St.Petersburg  2005    6.0      m
4  Kate         London  2001    NaN      f

In [63]:
df[df["Year"].apply(lambda year: year >= 2000)]

   Name           City  Year  Grade Gender
3  Ivan  St.Petersburg  2005    6.0      m
4  Kate         London  2001    NaN      f

<p>Применение метода <b>apply()</b> для вычислений</p>

In [64]:
data = np.random.randint(low=0, high=101, size=(3,7))
data

array([[92, 85, 23, 81, 54, 11, 57],
       [40,  1, 39, 11, 43, 64, 38],
       [74, 93, 79, 79, 97,  7, 41]])

In [65]:
dfA = pnd.DataFrame(data=data, 
                    columns=["Mon", "Tue", "Wed", "Thu", "Fri", "Sat", "Sun"], 
                    index = ["TV", "Smartphone", "Pendrive"])
dfA

            Mon  Tue  Wed  Thu  Fri  Sat  Sun
TV           92   85   23   81   54   11   57
Smartphone   40    1   39   11   43   64   38
Pendrive     74   93   79   79   97    7   41

In [66]:
clmn_sum = dfA.apply(lambda clmn: clmn.sum(), axis=0)  # axis = 0 - выбор по столбцам
clmn_sum

Mon    206
Tue    179
Wed    141
Thu    171
Fri    194
Sat     82
Sun    136
dtype: int64

In [67]:
type(clmn_sum)

pandas.core.series.Series

In [73]:
clmn_sum.name = "TotalByDay"
pnd.DataFrame(clmn_sum)

     TotalByDay
Mon         206
Tue         179
Wed         141
Thu         171
Fri         194
Sat          82
Sun         136

In [74]:
row_sum = dfA.apply(lambda row: row.sum(), axis=1)  # axis = 1 - выбор по строкам
row_sum

TV            1141
Smartphone     606
Pendrive      1362
dtype: int64

In [75]:
row_sum.name = "TotalByDevice"
pnd.DataFrame(row_sum)

            TotalByDevice
TV                   1141
Smartphone            606
Pendrive             1362

In [76]:
dfA["Working_Days"] = dfA.apply(lambda x: x[0:5].sum(), axis=1)
dfA

            Mon  Tue  Wed  Thu  Fri  Sat  Sun  Working_Days  Weekend
TV           92   85   23   81   54   11   57           335      403
Smartphone   40    1   39   11   43   64   38           134      236
Pendrive     74   93   79   79   97    7   41           422      470

In [77]:
dfA["Weekend"] = dfA.apply(lambda x: x[5:8].sum(), axis=1)
dfA

            Mon  Tue  Wed  Thu  Fri  Sat  Sun  Working_Days  Weekend
TV           92   85   23   81   54   11   57           335      403
Smartphone   40    1   39   11   43   64   38           134      236
Pendrive     74   93   79   79   97    7   41           422      470

In [78]:
# Удаление столбцов Working_Days и Weekend
dfA.drop(["Working_Days","Weekend"], axis=1, inplace=True)

<p>Нормализация значений по строке через <i>apply</i></p>

In [79]:
dfA.apply(lambda x: x/x.sum(), axis=1)

,Mon,Tue,Wed,Thu,Fri,Sat,Sun
TV,0.228288,0.210918,0.057072,0.200993,0.133995,0.027295,0.141439
Smartphone,0.169492,0.004237,0.165254,0.046610,0.182203,0.271186,0.161017
Pendrive,0.157447,0.197872,0.168085,0.168085,0.206383,0.014894,0.087234

<p>Нормализация через дополнительную функцию</p>

In [80]:
def norm(row):
    s = row.sum()
    return [el/s for el in row] # или return row/s

dfA.apply(norm, axis=1)

TV            [0.228287841191067, 0.2109181141439206, 0.0570...
Smartphone    [0.1694915254237288, 0.00423728813559322, 0.16...
Pendrive      [0.1574468085106383, 0.19787234042553192, 0.16...
dtype: object

<p>Применение метода <b>applymap()</b></p>

In [81]:
dfA

            Mon  Tue  Wed  Thu  Fri  Sat  Sun
TV           92   85   23   81   54   11   57
Smartphone   40    1   39   11   43   64   38
Pendrive     74   93   79   79   97    7   41

In [82]:
df4 = dfA.applymap(lambda cell: cell/100)
df4

             Mon   Tue   Wed   Thu   Fri   Sat   Sun
TV          0.92  0.85  0.23  0.81  0.54  0.11  0.57
Smartphone  0.40  0.01  0.39  0.11  0.43  0.64  0.38
Pendrive    0.74  0.93  0.79  0.79  0.97  0.07  0.41

<p>Изменение значений с использованием цикла</p>

In [83]:
df2 = pnd.DataFrame()
for clmn in dfA.columns:
    df2[clmn] = dfA.loc[:,clmn]/100

df2

             Mon   Tue   Wed   Thu   Fri   Sat   Sun
TV          0.92  0.85  0.23  0.81  0.54  0.11  0.57
Smartphone  0.40  0.01  0.39  0.11  0.43  0.64  0.38
Pendrive    0.74  0.93  0.79  0.79  0.97  0.07  0.41

<a name="4"></a>
<div style="display:table; width:100%; padding-top:10px; padding-bottom:10px; border-bottom:1px solid lightgrey">
    <div style="display:table-row">
        <div style="display:table-cell; width:80%; font-size:14pt; font-weight:bold">4. Математическая поддержка</div>
    	<div style="display:table-cell; width:20%; text-align:center; background-color:whitesmoke; border:1px solid lightgrey"><a href="#0">К содержанию</a></div>
    </div>
</div>

<div>
<p><b>Рассматриваемые вопросы:</b></p>
<p style="line-height:20pt">
a) операции со столбцами: <i>с использованием матрицы, списков, словаря, последовательностей</i><br> 
b) специалные методы: <i>count</i>, <i>min</i>, <i>max</i>, <i>sum</i>, <i>mean</i>, <i>var</i>, <i>std</i>, <i>describe</i>, <i>corr</i>, <i>cov</i><br> 
</div>

<a name="4a"></a>
<div style="padding-top:10px;">
    <div style="display: inline-block; font-style:italic; font-weight:bold; font-size:12pt">a. Операции со столбцами</div>
    <div style="display: inline-block; float:right; width:20%; text-align:center; border:1px solid lightgrey">
        <div style="display: inline-block; text-align:center; width:50%; background-color:whitesmoke;"><a href="#4">Назад</a></div><div style="display: inline-block; text-align:center; width:50%;"><a href="#4b">Далее</a></div>
    </div>
</div>

In [84]:
dfA

            Mon  Tue  Wed  Thu  Fri  Sat  Sun
TV           92   85   23   81   54   11   57
Smartphone   40    1   39   11   43   64   38
Pendrive     74   93   79   79   97    7   41

In [85]:
nom_values = dfA.Mon / 100
nom_values

TV            0.92
Smartphone    0.40
Pendrive      0.74
Name: Mon, dtype: float64

In [86]:
dfA.Mon = dfA.Mon + 10
dfA

            Mon  Tue  Wed  Thu  Fri  Sat  Sun
TV          102   85   23   81   54   11   57
Smartphone   50    1   39   11   43   64   38
Pendrive     84   93   79   79   97    7   41

In [87]:
sum_Mon_Tue = dfA["Mon"] + dfA["Tue"]
sum_Mon_Tue

TV            187
Smartphone     51
Pendrive      177
dtype: int64

In [88]:
mult_Mon_Tue = dfA["Mon"] * dfA["Tue"]
mult_Mon_Tue

TV            8670
Smartphone      50
Pendrive      7812
dtype: int64

<p>Пример вычисления суммы по всем столбцам с циклом <i>for</i></p>

In [89]:
dfA.columns

Index(['Mon', 'Tue', 'Wed', 'Thu', 'Fri', 'Sat', 'Sun'], dtype='object')

In [90]:
dfA["Total"] = dfA[dfA.columns[0]]
for i in range(1, len(dfA.columns)-1):
    dfA["Total"] += dfA[dfA.columns[i]]

dfA

            Mon  Tue  Wed  Thu  Fri  Sat  Sun  Total
TV          102   85   23   81   54   11   57    413
Smartphone   50    1   39   11   43   64   38    246
Pendrive     84   93   79   79   97    7   41    480

In [91]:
# Удаление столбца Total
dfA.drop(["Total"], axis=1, inplace=True)
dfA

            Mon  Tue  Wed  Thu  Fri  Sat  Sun
TV          102   85   23   81   54   11   57
Smartphone   50    1   39   11   43   64   38
Pendrive     84   93   79   79   97    7   41

<p>Пример вычисления суммы по всем столбцам с использованием <i>apply</i></p>

In [92]:
dfA["Total"] = dfA.apply(lambda row: row.sum(), axis=1)
dfA

            Mon  Tue  Wed  Thu  Fri  Sat  Sun  Total
TV          102   85   23   81   54   11   57    413
Smartphone   50    1   39   11   43   64   38    246
Pendrive     84   93   79   79   97    7   41    480

In [93]:
dfA.drop(["Total"], axis=1, inplace=True)

<p>Пример вычисления суммы по всем столбцам с использованием <i>sum</i></p>

In [94]:
dfA["Total"] = dfA.sum(axis=1)
dfA

            Mon  Tue  Wed  Thu  Fri  Sat  Sun  Total
TV          102   85   23   81   54   11   57    413
Smartphone   50    1   39   11   43   64   38    246
Pendrive     84   93   79   79   97    7   41    480

In [95]:
dfA.drop(["Total"], axis=1, inplace=True)

<a name="4b"></a>
<div style="padding-top:10px;">
    <div style="display: inline-block; font-style:italic; font-weight:bold; font-size:12pt">b. Специальные методы</div>
    <div style="display: inline-block; float:right; width:20%; text-align:center; border:1px solid lightgrey">
        <div style="display: inline-block; text-align:center; width:50%; background-color:whitesmoke;"><a href="#4a">Назад</a></div><div style="display: inline-block; text-align:center; width:50%;"><a href="#5">Далее</a></div>
    </div>
</div>

In [96]:
dfA.count(axis=0)

Mon    3
Tue    3
Wed    3
Thu    3
Fri    3
Sat    3
Sun    3
dtype: int64

In [97]:
dfA.count(axis=1)

TV            7
Smartphone    7
Pendrive      7
dtype: int64

In [98]:
dfA.min(axis=0)

Mon    50
Tue     1
Wed    23
Thu    11
Fri    43
Sat     7
Sun    38
dtype: int64

In [99]:
dfA.min(axis=1)

TV            11
Smartphone     1
Pendrive       7
dtype: int64

In [100]:
dfA["Mon"].min()

50

In [101]:
dfA["Mon"].idxmin()

'Smartphone'

In [102]:
dfA.max(axis=0)

Mon    102
Tue     93
Wed     79
Thu     81
Fri     97
Sat     64
Sun     57
dtype: int64

In [103]:
dfA.max(axis=1)

TV            102
Smartphone     64
Pendrive       97
dtype: int64

In [104]:
dfA["Mon"].idxmax()

'TV'

In [105]:
dfA.sum(axis=0)

Mon    236
Tue    179
Wed    141
Thu    171
Fri    194
Sat     82
Sun    136
dtype: int64

In [106]:
dfA.sum(axis=1)

TV            413
Smartphone    246
Pendrive      480
dtype: int64

In [107]:
dfA["Mon"].sum()

236

In [108]:
dfA.mean(axis=0)

Mon    78.666667
Tue    59.666667
Wed    47.000000
Thu    57.000000
Fri    64.666667
Sat    27.333333
Sun    45.333333
dtype: float64

In [109]:
dfA.mean(axis=1)

TV            59.000000
Smartphone    35.142857
Pendrive      68.571429
dtype: float64

In [110]:
dfA["Mon"].mean()

78.66666666666667

In [111]:
dfA.var(axis=0)

Mon     697.333333
Tue    2597.333333
Wed     832.000000
Thu    1588.000000
Fri     814.333333
Sat    1012.333333
Sun     104.333333
dtype: float64

In [112]:
dfA.var(axis=1)

TV            1106.333333
Smartphone     481.142857
Pendrive      1068.619048
dtype: float64

In [113]:
dfA.std(axis=1)

TV            33.261589
Smartphone    21.934969
Pendrive      32.689739
dtype: float64

In [114]:
dfA["Mon"].std()

26.407069760451144

In [115]:
dfA.describe()

,Mon,Tue,Wed,Thu,Fri,Sat,Sun
count,3.000000,3.000000,3.00000,3.000000,3.000000,3.000000,3.000000
mean,78.666667,59.666667,47.00000,57.000000,64.666667,27.333333,45.333333
std,26.407070,50.964040,28.84441,39.849718,28.536526,31.817186,10.214369
min,50.000000,1.000000,23.00000,11.000000,43.000000,7.000000,38.000000
25%,67.000000,43.000000,31.00000,45.000000,48.500000,9.000000,39.500000
50%,84.000000,85.000000,39.00000,79.000000,54.000000,11.000000,41.000000
75%,93.000000,89.000000,59.00000,80.000000,75.500000,37.500000,49.000000
max,102.000000,93.000000,79.00000,81.000000,97.000000,64.000000,57.000000

In [116]:
dfA["Mon"].describe()

count      3.000000
mean      78.666667
std       26.407070
min       50.000000
25%       67.000000
50%       84.000000
75%       93.000000
max      102.000000
Name: Mon, dtype: float64

In [117]:
dfA.corr()

          Mon       Tue       Wed       Thu       Fri       Sat       Sun
Mon  1.000000  0.910480 -0.105029  0.948386  0.361393 -0.916847  0.851464
Tue  0.910480  1.000000  0.315640  0.994632  0.714644 -0.999877  0.558367
Wed -0.105029  0.315640  1.000000  0.215757  0.889300 -0.300736 -0.610941
Thu  0.948386  0.994632  0.215757  1.000000  0.638426 -0.996131  0.641215
Fri  0.361393  0.714644  0.889300  0.638426  1.000000 -0.703598 -0.181257
Sat -0.916847 -0.999877 -0.300736 -0.996131 -0.703598  1.000000 -0.571295
Sun  0.851464  0.558367 -0.610941  0.641215 -0.181257 -0.571295  1.000000

In [118]:
dfA.cov()

,Mon,Tue,Wed,Thu,Fri,Sat,Sun
Mon,697.333333,1225.333333,-80.0,998.0,272.333333,-770.333333,229.666667
Tue,1225.333333,2597.333333,464.0,2020.0,1039.333333,-1621.333333,290.666667
Wed,-80.000000,464.000000,832.0,248.0,732.000000,-276.000000,-180.000000
Thu,998.000000,2020.000000,248.0,1588.0,726.000000,-1263.000000,261.000000
Fri,272.333333,1039.333333,732.0,726.0,814.333333,-638.833333,-52.833333
Sat,-770.333333,-1621.333333,-276.0,-1263.0,-638.833333,1012.333333,-185.666667
Sun,229.666667,290.666667,-180.0,261.0,-52.833333,-185.666667,104.333333

<a name="5"></a>
<div style="display:table; width:100%; padding-top:10px; padding-bottom:10px; border-bottom:1px solid lightgrey">
    <div style="display:table-row">
        <div style="display:table-cell; width:80%; font-size:14pt; font-weight:bold">5. Визуализация данных</div>
    	<div style="display:table-cell; width:20%; text-align:center; background-color:whitesmoke; border:1px solid lightgrey"><a href="#0">К содержанию</a></div>
    </div>
</div>

<div>
<p><b>Рассматриваемые вопросы:</b></p>
<p style="line-height:20pt">
a) построение графиков (plot)</i><br> 
b) построение гистограмм<br> 
</p>
</div>

<a name="5a"></a>
<div style="padding-top:10px;">
    <div style="display: inline-block; font-style:italic; font-weight:bold; font-size:12pt">a. График (plot)</div>
    <div style="display: inline-block; float:right; width:20%; text-align:center; border:1px solid lightgrey">
        <div style="display: inline-block; text-align:center; width:50%; background-color:whitesmoke;"><a href="#5">Назад</a></div><div style="display: inline-block; text-align:center; width:50%;"><a href="#5b">Далее</a></div>
    </div>
</div>

In [ ]:
%matplotlib inline
dfA.T.plot()

In [ ]:
pl = dfA.loc["TV",:].plot(title="TV")
pl.set_xlabel("Day of the Week")
pl.set_ylabel("Count")

<a name="5b"></a>
<div style="padding-top:10px;">
    <div style="display: inline-block; font-style:italic; font-weight:bold; font-size:12pt">b. Гистограмма</div>
    <div style="display: inline-block; float:right; width:20%; text-align:center; border:1px solid lightgrey">
        <div style="display: inline-block; text-align:center; width:50%; background-color:whitesmoke;"><a href="#5a">Назад</a></div><div style="display: inline-block; text-align:center; width:50%;"><a href="#6">Далее</a></div>
    </div>
</div>

In [ ]:
dfA.hist(bins=4)

In [ ]:
dfA.T.hist(bins=4)

<a name="6"></a>
<div style="display:table; width:100%; padding-top:10px; padding-bottom:10px; border-bottom:1px solid lightgrey">
    <div style="display:table-row">
        <div style="display:table-cell; width:80%; font-size:14pt; font-weight:bold">6. Источники</div>
    	<div style="display:table-cell; width:20%; text-align:center; background-color:whitesmoke; border:1px solid lightgrey"><a href="#0">К содержанию</a></div>
    </div>
</div>

<div><p>Документация</p>
<a href="https://pandas.pydata.org/pandas-docs/version/0.25.1/index.html">Pandas 0.25.1 documentation. Index</a><br>

<p>Разбор функциональных возможностей</p>
<a href="http://pandas.pydata.org/pandas-docs/stable/dsintro.html">Intro to Data Structures</a><br>
<a href="http://pandas.pydata.org/pandas-docs/stable/indexing.html">Indexing and Selecting Data</a><br>
<a href="http://pandas.pydata.org/pandas-docs/stable/io.html">IO Tools (Text, CSV, HDF5, ...)</a><br>
<a href="http://pandas.pydata.org/pandas-docs/stable/groupby.html">Group By: split-apply-combine</a><br>
<a href="http://pandas.pydata.org/pandas-docs/stable/advanced.html">MultiIndex / Advanced Indexing</a><br>
<a href="http://pandas.pydata.org/pandas-docs/stable/merging.html">Merge, join, and concatenate</a><br>
<a href="http://pandas.pydata.org/pandas-docs/stable/merging.html">Essential Basic Functionality</a><br>
<a href="https://s3.amazonaws.com/quandl-static-content/Documents/Quandl+-+Pandas,+SciPy,+NumPy+Cheat+Sheet.pdf">NumPy / SciPy / Pandas Cheat Sheet</a><br>
<a href="http://www.swegler.com/becky/blog/2014/08/06/useful-pandas-snippets/">Useful Pandas Snippets</a><br>
<a href="http://chrisalbon.com/python/pandas_apply_operations_to_dataframes.html">Applying Operations Over pandas Dataframes</a><br>
<a href="http://nbviewer.jupyter.org/urls/bitbucket.org/hrojas/learn-pandas/raw/master/lessons/01%20-%20Lesson.ipynb">Pandas. Lesson 1</a><br>
<a href="http://chrisalbon.com/python/pandas_dropping_column_and_rows.html">Dropping Rows And Columns In pandas Dataframe</a><br>
<a href="http://chrisalbon.com/python/pandas_dataframe_descriptive_stats.html">Descriptive Statistics For pandas Dataframe</a><br>

<p>Примеры использования</p>
<a href="http://synesthesiam.com/posts/an-introduction-to-pandas.html">An Introduction to Pandas (weather analysis)</a><br>
<a href="http://pbpython.com/excel-pandas-comp.html">Common Excel Tasks Demonstrated in Pandas</a><br>
<a href="http://wavedatalab.github.io/datawithpython/aggregate.html">Using Pandas for Analyzing Data - Grouping and Aggregating</a><br>
<a href="http://dataconomy.com/14-best-python-pandas-features/">14 BEST PYTHON PANDAS FEATURES</a><br>
<a href="http://www.randalolson.com/2012/08/06/statistical-analysis-made-easy-in-python/">Statistical analysis made easy in Python with SciPy and pandas DataFrames</a><br>
</div>